In [10]:
import pandas as pd
import numpy as np

print("Dataframe 1 (hardcoded) ");
pd.DataFrame({'Title1': [1, 2], 'Title2': [3, 4]})  # if no index column included, it start with zero.

Dataframe 1 (hardcoded)

   Title1  Title2
0       1       3
1       2       4

In [19]:
print("Dataframe 2 with index column (hardcoded)");
df = pd.DataFrame({'Bob': [1,2], 
              'CHAN': [3,4]},
             index=['A', 'B'])

display(df) # or just df

Dataframe 2 with index column (hardcoded)

   Bob  CHAN
A    1     3
B    2     4

In [18]:
# to read csv file to 
df = pd.read_csv(r'c:\workspace\python\a.csv.txt', usecols=[0,1],header=None, names=['Name', 'StaffId'])
#df.head()  
#df.Name # give the data column , note it is case sensitive 
#df['Name'] # same as above 
df['Name'][0] # first element

'Anderson Chau'

In [38]:
#iloc (1st idx -- ROW , 2nd dx COLUMN ), different from normal Python 
# i for index (in fact positional based indexing) based, if index label of DF is a/b instead of 0/1, you can still use iloc[1:2,1] to access data
# It is different from loc which is label based indexing

data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, 10000, 46000,  
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}) 

#data
display(data.iloc[[0, 2, 4, 7]])  # selecting 0th, 2th, 4th, and 7th index rows 
display(data.iloc[1 : 5, 2 : 5]) 
# selecting rows from 1 to 4 and columns from 2 to 4 
# * start from ZERO + last exclusive 
display(data.iloc[:, 0]) # select all ROWS and first column
display(data.iloc[:3, 0]) # select first 3 rows 
display(data.iloc[1:3, 0]) # select first 2nd and 3rd column
data.iloc[[0, 1, 2], 0] # first 3 rows 
# can be negative number 
############################################################################################
############################################################################################

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
2    Tata  2011       60000   Mumbai       25
4  Maruti  2012       10000   Mumbai       28
7    Tata  2018       15000  Chennai       21

   Kms Driven    City  Mileage
1       30000   Delhi       27
2       60000  Mumbai       25
3       25000   Delhi       26
4       10000  Mumbai       28

0      Maruti
1     Hyundai
2        Tata
3    Mahindra
4      Maruti
5     Hyundai
6     Renault
7        Tata
8      Maruti
Name: Brand, dtype: object

0     Maruti
1    Hyundai
2       Tata
Name: Brand, dtype: object

1    Hyundai
2       Tata
Name: Brand, dtype: object

NameError: name 'describe' is not defined

In [22]:
# loc is labal based , 
data.loc[(data.Year < 2015), ['Mileage']]

   Mileage
0       28
1       27
2       25
4       28
6       24

In [25]:
data.loc[1:3, ['City','Mileage']] 
# this should be read as following : 
# for row , we have index 1,2,3 .... as label , 1:3 is the labels from 1 to 3 
# loc applies to index having a,b, as label.

     City  Mileage
1   Delhi       27
2  Mumbai       25
3   Delhi       26

In [24]:
data.iloc[1:3]

     Brand  Year  Kms Driven    City  Mileage
1  Hyundai  2014       30000   Delhi       27
2     Tata  2011       60000  Mumbai       25

In [35]:
# Using a particular column as index column
#data.set_index("some_column_name_with_unqiue_value")

data.Year == 2011 # give a SERIES of Boolean , it is useful for selection. 
data.loc[(data.Year == 2011) | (data.Mileage == 27)] # notice , bracket is needed ! otherwise compile error

     Brand  Year  Kms Driven    City  Mileage
1  Hyundai  2014       30000   Delhi       27
2     Tata  2011       60000  Mumbai       25

In [36]:
data.loc[data.Year.isin([2011,2014])]

     Brand  Year  Kms Driven    City  Mileage
1  Hyundai  2014       30000   Delhi       27
2     Tata  2011       60000  Mumbai       25
6  Renault  2014       31000  Mumbai       24

In [39]:
#data.loc[data.Kms.notnull()] 
#data['Driven'] = 1234 # assign all values of Driven column to value 1234
#data['Driven'] = range(len(data), 0, -1) # assign series of value the the column. 8,7.... 1

In [43]:
print('mean is ' + str(data.Mileage.mean())) # get the mean value of the column

data.Mileage.describe() # gives statistical information of the column data

mean is 25.77777777777778

count     9.000000
mean     25.777778
std       2.538591
min      21.000000
25%      24.000000
50%      26.000000
75%      28.000000
max      29.000000
Name: Mileage, dtype: float64

In [44]:
data.City.unique() # gives the array of all unique value

array(['Gurgaon', 'Delhi', 'Mumbai', 'Chennai', 'Ghaziabad'], dtype=object)

In [45]:
data.City.value_counts() # happening rate

Delhi        3
Mumbai       3
Ghaziabad    1
Gurgaon      1
Chennai      1
Name: City, dtype: int64

In [49]:
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, 10000, 46000,  
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}) 
meanValue = data.Mileage.mean()
print('Mean value is ' + str(meanValue))
data.Mileage.map(lambda p: p - meanValue) 
# p is each value in Mileage column
# we are doing something like normalization
# this does not change the column values 
# map only works with per single value (meanValue)

Mean value is 25.77777777777778

0    2.222222
1    1.222222
2   -0.777778
3    0.222222
4    2.222222
5    3.222222
6   -1.777778
7   -4.777778
8   -1.777778
Name: Mileage, dtype: float64

In [59]:

# https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas
data2 = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Mileage' :  [1, 4, 6, 7, 1,  
                                   2, 3, 4, 5]}) 
mileageMean = data2.Mileage.mean()

def remean_points(row):
    row.Mileage = row.Mileage - mileageMean
    return row


data2.apply(remean_points, axis='columns')

      Brand   Mileage
0    Maruti -2.666667
1   Hyundai  0.333333
2      Tata  2.333333
3  Mahindra  3.333333
4    Maruti -2.666667
5   Hyundai -1.666667
6   Renault -0.666667
7      Tata  0.333333
8    Maruti  1.333333

In [60]:
# Group by operations 
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}) 
data.groupby('Mileage').Mileage.count() # same as data.Mileage.value_counts()
# groupby('Mileage') -> treat same value of mileage as a group 
# next Mileage : operate on this column. 
# Other Examples:
# reviews.groupby('points').price.min()  # Give the lowest price for each point.
# reviews.groupby('winery').apply(lambda df: df.title.iloc[0]) # get the first title of each type of wine 
# reviews.groupby(['country', 'province']).apply(lambda df: df.loc[df.points.idxmax()])
# can be grouped by more than one column
# <-- pick the highest score for each review of each country+provience

# reviews.groupby(['country']).price.agg([len, min, max])
# <-- summarize occurrance (len), min, max for each country.
#countries_reviewed = reviews.groupby(['country', 'province']).description.agg([len])
# it is multi-index data frame

Mileage
21    1
24    2
25    1
26    1
27    1
28    2
29    1
Name: Mileage, dtype: int64

In [ ]:
#data type 
# reviews.price.dtype
#reviews.dtypes
#reviews.points.astype('float64') # convert to data type

#reviews[pd.isnull(reviews.country)] # select all the rows having country column null value
# reviews.region_2.fillna("Unknown") # fill null with unknown string for region_2
# reviews.taster_twitter_handle.replace("@kerinokeefe", "@kerino") # replacing value

#reviews.rename(columns={'points': 'score'}) # rename a column
#reviews.rename(index={0: 'firstEntry', 1: 'secondEntry'})
#reviews.rename_axis("wines", axis='rows').rename_axis("fields", axis='columns')


#join() will join on index  
#left = canadian_youtube.set_index(['title', 'trending_date'])
#right = british_youtube.set_index(['title', 'trending_date'])

#left.join(right, lsuffix='_CAN', rsuffix='_UK') # lrsuffix rename columns for each separate dataframe
# pd.concat([canadian_youtube, british_youtube]) # concat 2 data frame

In [27]:
# Pandas : Handling Missing Data.

tmpDF = pd.read_csv(r'c:\workspace\python\b.csv.txt',header=0)
tmpDF

tmpDF.Name.isnull().sum() / len(tmpDF) # check how many percent of values is NaN
tmpDF.isnull().sum().sum() / np.product(tmpDF.shape)
#tmpDF = tmpDF.dropna(axis=0) # drop all rows, add inplace= True for for modification to DF 
#tmpDF.dropna(axis=1) # drop all columns with NaN
print('Before')
print(tmpDF)
tmpDF = tmpDF.fillna(method='bfill', axis=0) # or fillna(0) , just fill with zero
# bfill = fill with back fill method , fill with 0
print('After')
print(tmpDF)

Before
            Name   Age
0  Anderson Chau  39.0
1     Anson Ting  35.0
2            NaN  22.0
3          David   NaN
4           Jane  33.0
After
            Name   Age
0  Anderson Chau  39.0
1     Anson Ting  35.0
2          David  22.0
3          David  33.0
4           Jane  33.0

Simple dropping may not be a good idea <br>
-- if NaN is too many, may drop high proportion of data, not good if actually not enough data<br>
-- it may reflect a systematic problem (System bug / limitation ?)<br>
-- not recoreded (reasonable to guess) vs Dont actually exist (mark it not exist)? <br>
-- need to look at each column<br>
-- blunt record removal may cause noise / removed useful information.<br>

Some ML algo works badly if data not normalized, Logistics regression, NN<br>
Some optimization algo works badly when not normalized, lead to sub-obtimal result<br>
# https://medium.com/@rrfd/standardize-or-normalize-examples-in-python-e3f174b65dfc

In [6]:
# Min max scaler 

import pandas as pd
from sklearn import preprocessing
df = pd.DataFrame({'A':[14.00,90.20,90.95,96.27,91.21],'B':[103.02,107.26,110.35,114.23,114.68]})
x = df.values #returns a numpy array
min_max_scaler = preprocessing.MinMaxScaler()
x_scaled = min_max_scaler.fit_transform(x)
df = pd.DataFrame(x_scaled)
df

          0         1
0  0.000000  0.000000
1  0.926219  0.363636
2  0.935335  0.628645
3  1.000000  0.961407
4  0.938495  1.000000

In [ ]:
# date time parsing 
#landslides['date_parsed'] = pd.to_datetime(landslides['date'], format="%m/%d/%y")  # convert string to date type
#day_of_month_landslides = landslides['date_parsed'].dt.day #get the day field for the time

In [ ]:
# read CSV with another encoding
#kickstarter_2016 = pd.read_csv("../input/kickstarter-projects/ks-projects-201612.csv", encoding='Windows-1252')

#countries = professors['Country'].unique() # returns unique values
#professors['Country'] = professors['Country'].str.lower() to lower , upper for upper()